#include "pass2.h"
#include "middle.h"
#include <stdio.h>

void Pass_2() {

	//////////////////////////////////////
	//명령코드표

	//명령 코드표 탐색
	void P2_search_optab() {

	}

	//연산코드

	///////////////////////////////////////

	//명령과 자료의 어셈블
	void P2_assemble_init() {

	}

	///////////////////////////////////////

	//어셈블된 명령과 주소가 지정된 자료

	///////////////////////////////////////

	//1
	//목적프로그램 작성(주석문이 아닌 각 문장마다.)
	void P2_write_odj() {

	}

	//2
	//어셈블리 리스트 작성(각 원시문장마다.)
	void P2_write_list() {

	}

	//void Access_int_file(각원시 문장마다.)

}
